"""
@author: s.suvorova
1. Даны два произвольных списка. Удалите из первого списка элементы, присутствующие во втором.
    Примечание. Списки создайте вручную, например:
my_list_1 = [2, 5, 8, 2, 12, 12, 4]
my_list_2 = [2, 7, 12, 3]
"""
my_list_1 = [2, 5, 8, 2, 12, 12, 4, 45, 4, 6, 0, 23]
my_list_2 = [2, 7, 12, 3, 4, 5,11]
for num in my_list_2:
    while num in my_list_1:
        my_list_1.remove(num)
print(my_list_1)
